"Context-Free Grammars\n\nA grammar is a set of rules for putting strings together, and it corresponds to a language.Grammars\n\nA grammar consists of:\n• A set of variables (also called nonterminals), one of which is designated as the start variable. It is customary to use upper-case letters for variables.\n• A set of terminals (from the alphabet).\n• A list of productions (also called rules).Example: 0n1n\nHere is a grammar:\nS → 0S1\nS → ε\nS is the only variable. The terminals are 0 and 1.\nThere are two productions.\nGoddard 6a: 3Using a Grammar\n\nA production allows one to take a string containing a variable and replace the variable by the right-hand side (RHS) of the production. A string of terminals is generated by the grammar if, starting with the start variable, one can apply productions and end up with that string. The sequence of strings obtained in this way is called a derivation.\n\nWe focus on a special version of grammars called a context-free grammar (CFG). A language is context-free if it is generated by a CFG.Example Continued\n\nThe production rules for the grammar are:\n\nS → 0S1\nS → ε\n\nThe string 0011 is in the language generated by this grammar. The derivation is as follows:\n\nS ⇒ 0S1 ⇒ 00S11 ⇒ 0011\n\nFor compactness, we can write the production rules as:\n\nS → 0S1 | ε\n\nwhere the vertical bar means 'or.'Example: Palindromes\nLet P be the language of palindromes with alphabet {a, b}. One can determine a Context-Free Grammar (CFG) for P by finding a recursive decomposition. If we remove the first and last symbols from a palindrome, what remains is also a palindrome. Furthermore, if we wrap a palindrome with the same symbol at the front and back, it is still a palindrome.\nThe CFG is:\nP → aPa | bPb | ε\nThis actually generates only those palindromes of even length.Formal Definition\nOne can provide a formal definition of a context-free grammar. It is a 4-tuple (V, Σ, S, P) where:\n• V is a finite set of variables;\n• Σ is a finite alphabet of terminals;\n• S is the start variable; and\n• P is the finite set of productions. Each production has the form V → (V ∪ Σ)*.Further Examples: Even 0’s\n\nA Context-Free Grammar (CFG) for all binary strings with an even number of 0’s is given below. To find the decomposition:\n\n- If the first symbol is 1, then there remains an even number of 0’s.\n- If the first symbol is 0, proceed to the next 0; after that, there will again be an even number of 0’s remaining.\n\nThis yields the following productions:\n\nS → 1S | 0A0S | ε\nA → 1A | εAlternate CFG for Even 0's\nHere is another Context-Free Grammar (CFG) for the same language. Note that when the first symbol is 0, what remains has an odd number of 0's.Alternate CFG for Even 0's\n\nHere is another Context-Free Grammar (CFG) for the same language.\nNote that when the first symbol is 0, what remains has an odd number of 0's.\n\nS → 1S | 0T | ε\nT → 1T | 0SExample\nA Context-Free Grammar (CFG) for the regular language corresponding to the Regular Expression (RE) 00*11*.\nGoddard 6a: 11Example\nA Context-Free Grammar (CFG) for the regular language corresponding to the Regular Expression (RE) 00*11*.\nThe language is the concatenation of two languages: all strings of zeroes followed by all strings of ones.\n\nProductions:\nS → CD\nC → 0C | 0\nD → 1D | 1\n\nGoddard 6a: 12Example Complement\nA Context-Free Grammar (CFG) for the complement of the regular expression 00*11*.\n\nCFGs do not handle conjunctions (\"and\"), but they can handle disjunctions (\"or\"). A string that is not of the form 0^i1^j where i, j > 0 is one of the following: it contains the substring 10, it consists only of zeroes, or it consists only of ones. This leads to the following CFG:\n\nS → A | B | C\nA → D 10 D\nD → 0 D | 1 D | ε\nB → 0 B | 0\nC → 1 C | 1Consistency and Completeness\n\nNote that to check a grammar and description match, one must check two things: that everything the grammar generates fits the description (consistency), and everything in the description is generated by the grammar (completeness).\n\nGoddard 6a: 14Example\nConsider the context-free grammar (CFG):\n\nS → 0S1S | 1S0S | ε\n\nThe string 011100 is generated as follows:\n\nS ⇒ 0S1S ⇒ 01S ⇒ 011S0S ⇒ 0111S0S ⇒ 01110S0S ⇒ 011100S ⇒ 011100\n\nWhat does this language contain? Certainly, every string generated has an equal number of 0’s and 1’s. However, can any string with equal 0’s and 1’s be generated?Example Argument for Completeness\n\nYes. All strings with equal numbers of 0’s and 1’s are generated:\nWell, at some point, equality between 0’s and 1’s is reached. The key is that if a string starts with 0, then equality is first reached at a 1. So the portion between the first 0 and this 1 is itself an example of equality, as is the portion after this 1. That is, one can break up the string as 0w1x with both w and x in the language.\n\nThe break-up of the string 00101101 is as follows:\n0 0 1 0 1 1 0 1\nw x\n\nGoddard 6a: 16A Silly Language Context-Free Grammar (CFG) \n\nThis CFG generates sentences composed of noun phrases and verb phrases: \n\nS → NP VP \nNP → the N \nVP → V NP \nV → sings | eats \nN → cat | song | canary \n\nThis generates sentences like \"the canary sings the song\", but also \"the song eats the cat\". \n\nThis CFG generates all \"legal\" sentences, not just meaningful ones.Practice\n\nGive grammars for the following two languages:\n\n1. All binary strings with both an even number of zeroes and an even number of ones.\n\n2. All strings of the form 0^a 1^b 0^c where a + c = b. \n   (Hint: it’s the concatenation of two simpler languages.)\n\nGoddard 6a: 18Practice Solutions\n\n1) The production rules are as follows:\n   S → 0X | 1Y | ε\n   X → 0S | 1Z (odd zeroes, even ones)\n   Y → 1S | 0Z (odd ones, even zeroes)\n   Z → 0Y | 1X (odd ones, odd zeroes)\n\n2) The production rules are:\n   S → TU\n   T → 0T1 | ε\n   U → 1U0 | ε\n\nGoddard 6a: 19Summary\nA context-free grammar (CFG) consists of a set of productions that you use to replace a variable with a string of variables and terminals. The language of a grammar is the set of strings it generates. A language is context-free if there is a CFG for it."