"Closure Properties of Regular Languages\n\nWe show how to combine regular languages.Closure Properties\n\nA set is closed under an operation if applying that operation to any members of the set always yields a member of the set.\n\nFor example, the positive integers are closed under addition and multiplication, but not division.Closure under Kleene\n\nFact:\nThe set of regular languages is closed under each Kleene operation. That is, if L1 and L2 are regular languages, then each of L1 ∪ L2, L1L2, and L1* is regular.Proving Closure under Kleene\n\nThe easiest approach is to show that the regular expressions (REs) for L1 and L2 can be combined or adjusted to form the RE for the combination language.\n\nExample: The RE for the concatenation of L1 and L2 (denoted as L1L2) is obtained by writing down the RE for L1 followed by the RE for L2.Closure under Complementation\n\nFact:\nThe set of regular languages is closed under complementation. The complement of a language L, written as L', is all strings not in L but with the same alphabet. This means that if L is a regular language, then L' is also a regular language.\n\nTo see this fact, take a deterministic finite automaton (FA) for L and interchange the accept and reject states.Closure under Intersection\n\nFact:\nThe set of regular languages is closed under intersection.\n\nOne approach: Use de Morgan’s law:\nL1 ∩ L2 = (L1 ∪ L2)'\n\nAdditionally, regular languages are closed under union and complementation.Product Construction for Intersection\n\nEach state in the product is a pair of states from the original machines.\n\nFormally, if L1 is accepted by DFA M1 with the 5-tuple (Q1, Σ, q1, T1, δ1) and L2 is accepted by DFA M2 with the 5-tuple (Q2, Σ, q2, T2, δ2), then L1 ∩ L2 is accepted by the DFA (Q1 × Q2, Σ, (q1, q2), T1 × T2, δ) where δ((r, s), x) = (δ1(r, x), δ2(s, x)).Example: Even 0’s and 1’s\nSuppose L1 is the set of binary strings with an even number of 0’s, and L2 is the set of binary strings with an even number of 1’s. The finite automata (FAs) for these languages both have two states:\n\nState Transition Diagram for L1:\nState A: \n- Input 1: Stay in State A\n- Input 0: Move to State B\n\nState Transition Diagram for L2:\nState B:\n- Input 1: Move to State A\n- Input 0: Stay in State B\n\nThus, the finite automata for the intersection of L1 and L2, denoted as L1 ∩ L2, has four states.Product Construction for Even 0’s and 1’s\n\nA, X\nA, Y\nB, Y\nB, X\n\n1\n1\n1\n1\n0\n0\n0\n0\n\nGoddard 4a: 9Overview\n\nA regular language is one which has a Finite Automaton (FA) or a Regular Expression (RE). Regular languages are closed under the following operations: union, concatenation, star, and complementation."